<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE>Artefact Viewer User Manual German</TITLE>

	<STYLE TYPE="text/css">
	<!--
		@page { margin-left: 4cm; margin-right: 2cm; margin-top: 2.5cm; margin-bottom: 2.5cm }
		@page:first { }
		P { page-break-inside: avoid; widows: 136; page-break-before: auto }
		H1 { page-break-inside: avoid; widows: 136; page-break-before: auto }
		H1.western { font-family: "Times New Roman", serif; font-size: 12pt }
		H1.cjk { font-family: "MS Mincho"; font-size: 16pt }
		H1.ctl { font-family: "Tahoma"; font-size: 16pt }
		A:visited { so-language: de-DE }
	-->
	</STYLE>
</HEAD>
<BODY LANG="de-DE" DIR="LTR">
<P ALIGN=CENTER STYLE="page-break-inside: avoid; widows: 132"><FONT SIZE=7>Artefact
Viewer</FONT></P>
<P ALIGN=CENTER STYLE="page-break-inside: avoid; widows: 132"><BR><BR>
</P>
<P ALIGN=CENTER STYLE="page-break-inside: avoid; widows: 132"><FONT SIZE=6 STYLE="font-size: 22pt">Handbuch</FONT></P>
<P ALIGN=CENTER STYLE="page-break-inside: avoid; widows: 132"><BR><BR>
</P>
<P ALIGN=CENTER STYLE="page-break-inside: avoid; widows: 132"><FONT SIZE=6 STYLE="font-size: 22pt">Version
0.1</FONT></P>
<P ALIGN=CENTER STYLE="page-break-inside: avoid; widows: 132"><BR><BR>
</P>
<DIV ID="Inhaltsverzeichnis1" DIR="LTR">
	<DIV ID="Inhaltsverzeichnis1_Head" DIR="LTR">
		<P STYLE="page-break-before: always; page-break-after: avoid"><FONT FACE="Times New Roman, serif"><FONT SIZE=3><B>Inhaltsverzeichnis</B></FONT></FONT></P>
	</DIV>
	<ul>
	<li><a href="#1">1.) Datei &ouml;ffnen</a></li>
	<li><a href="#2">2.) Hintergrund einstellen</a></li>
	<li><a href="#3">3.) Artefakt ausrichten</a></li>
	<li><a href="#4">4.) Beleuchtung einstellen</a></li>
	<li><a href="#5">5.) Visuelle Verbesserungen</a></li>
	<li><a href="#6">6.) Kommentare und Vermessung</a></li>
	<li><a href="#7">7.) Screenshots und Offscreen Rendering</a></li>
	<li><a href="#8">8.) Datei speichern</a></li>
	</ul>
	<BR><BR>
</DIV>
<H1 id="1" CLASS="western" STYLE="page-break-before: always">1.) Datei &ouml;ffnen</H1>
<P>Bei Programmstart werden zun&auml;chst nur die Lichtquellen angezeigt. Ansonsten ist das Hauptfenster erst mal leer.</P>
Um eine Datei zu &ouml;ffnen, gibt es in der Men&uuml;leiste unter
&bdquo;File&ldquo; den Eintrag &bdquo;Open&ldquo;. Im sich &ouml;ffnenden
Dateiauswahlfenster muss eine PLY- oder eine STL-Datei ausgew&auml;hlt werden.</P>
<P>Nach dem Laden der Datei wird deren Inhalt angezeigt. Dabei ist zu
beachten: Wenn der Datei eine XML-Datei mit gespeicherten
Informationen zur Ansicht beilag, kann die Anzeige vom folgenden Bild
abweichen.</P>
<P><IMG SRC="usermanual_file_loaded.jpg" NAME="Grafik2" BORDER=0><BR><BR>
</P>
<H1 id="2" CLASS="western" STYLE="page-break-before: always">2.) Hintergrund
einstellen</H1>
<P>Wen der komplett schwarze Hintergrund st&ouml;rt, kann &uuml;ber
das Men&uuml; &bdquo;Options&ldquo; und &bdquo;Background Color&ldquo;
w&auml;hlen und sich dort einen Farbverlauf erstellen. Dabei ist
zun&auml;chst die untere Farbe auszuw&auml;hlen, dies zu best&auml;tigen
und dann die obere Farbe auszuw&auml;hlen. Ist ein einfarbiger
Hintergrund gew&uuml;nscht, muss zweimal dieselbe Farbe gew&auml;hlt
werden. Das folgende Bild zeigt einen m&ouml;glichen Hintergrund.</P>
<H1 CLASS="western"><IMG SRC="usermanual_background.jpg" NAME="Grafik3" BORDER=0><BR CLEAR=LEFT></H1>
	<BR><BR>
<H1 id="3" CLASS="western" STYLE="page-break-before: always">3.) Artefakt ausrichten</H1>
<P>Das Artefakt kann auf drei Arten ausgerichtet werden. Mit der Maus, mit
Buttons in der Benutzeroberfl&auml;che und mit Tastaturk&uuml;rzeln.</P>
<P>Mit der rechten Maustaste kann das Artefakt gedreht werden. Dabei wird die
sogenannte Trackball-Metapher verwendet. &uuml;ber dem Fenster befindet sich eine
imagin&auml;re Halbkugel, die mit der Maus manipuliert wird. Dies erm&ouml;glicht
Drehungen um alle drei Koordinatenachsen.</P>
<P>Wird die Shift-Taste auf der Tastatur gedr&uuml;ckt gehalten, kann das Artefakt mit der rechten
Maustaste verschoben werden. Dies dient der Erkundung von speziellen Objekten wie W&auml;nden, die
aufgrund ihrer Gr&ouml;&szlig;e nicht durch die normale
Mausnavigation abgedeckt werden k&ouml;nnen, und auch kleinen,
gebogenen Artefakten, bei denen ein &auml;u&szlig;erer Teil des
Artefakts den zu betrachten inneren Teil verdeckt.</P>
<P><IMG SRC="usermanual_rotation.jpg" NAME="Grafik4" BORDER=0><BR><BR>
</P>
<P>Auch die Buttons in der Benutzeroberfl&auml;che erm&ouml;glichen Drehungen um alle drei
Koordinatenachsen. Die Pfeile nach links und rechts drehen um die y-Achse, die Pfeile
nach oben und unten um die x-Achse und die kreisf&ouml;rmigen Pfeile drehen um die z-Achse.
Der Winkel, um den pro Mausklick gedreht wird, kann mit Hilfe der Radio-Buttons rechts neben
den Pfeilen eingestellt werden. Der unterste Radio-Button erlaubt
die Eingabe eines Benutzerdefinierten Winkels. Mit dem Reset-Button werden sowohl die Rotation
als auch dier Verschiebung des Objekts zur&uuml;ckgesetzt</P>
<P>Als letzes kann das Objekt auch mit der Tastatur gedreht werden. Die Pfeiltasten haben die
gleiche Funktion wie die Buttons in der graphischen Benutzeroberfl&auml;che. Zus&auml;tzlich k&ouml;nnen die Zahltasten
4 und 6 wie die Pfiele nach links und rechts, und die Zahltasten 2 und 8 wie die Pfeile nach oben und unten
benutzt werden. Drehungen um die z-Achse werden mit den Zahltasten 7 und 9 ausgef&uuml;hrt.</P>

<!--
<P ALIGN=JUSTIFY STYLE="widows: 136"><IMG SRC="usermanual_html_724d1e2e.png" NAME="Grafik5" BORDER=0><BR><BR>
</P>-->


	<BR><BR>
<H1 id="4" CLASS="western" STYLE="page-break-before: always">4.) Beleuchtung
einstellen</H1>
<P>Um das Artefakt richtig in Szene zu setzen, kann nun die
Beleuchtung eingestellt werden.  Wichtig ist, dass bis hierhin die
Ausrichtung des Artefakts abgeschlossen ist, denn bei einmal
eingerichteter Beleuchtung w&uuml;rde einer weitere Drehung des
Objekts nat&uuml;rlich dazu f&uuml;hren, dass die bereits
zufriedenstellend ausgeleuchteten Bereiche wieder verschoben werden.</P>
<IMG SRC="usermanual_lighting.jpg" NAME="Grafik8" BORDER=0>
<P>Um die Beleuchtung einzustellen, muss sie &uuml;ber das H&auml;kchen
&bdquo;Use Lighting&ldquo; aktiviert sein. In der Dropdownliste unter
&bdquo;Lights&ldquo; kann jede der vier Lampen einzeln ausgew&auml;hlt
werden, um sie zu konfigurieren, bleiben wir jedoch zun&auml;chst bei
Lampe 1.</P>
<P>Jede Lampe kann ein- und ausgeschaltet werden. Unabh&auml;ngig
davon kann die Darstellung der Repr&auml;sentationen der Lampen im
3D-Bereich in Form von rudiment&auml;ren Lampenschirmen angezeigt
oder versteckt werden (&bdquo;Lights visible&ldquo;). Solange die
Lampe ausgerichtet wird, ist es n&uuml;tzlich, sie im 3D-Raum auch zu
sehen. Sollen sp&auml;ter Screenshots gemacht werden, k&ouml;nnen die
Lampen versteckt werden.</P>
<P>Intensity regelt die Helligkeit der Lampe, Distance regelt die
Entfernung der Lampe zum Objekt.</P>
<P>Um die &uuml;brigen zwei Regler zu verstehen, muss man wissen,
dass die Lampe sich immer auf einer Kugelh&uuml;lle um das Objekt
bewegt. So l&auml;sst der Regler &bdquo;Horizontal Rotation&ldquo;
die Lampe auf einer Kreisbahn um das Artefakt fliegen, die horizontal
im Raum liegt (gr&uuml;ner Kreis), w&auml;hrend der letzte verbleibende und
unbeschriftete Regler die Kamera &ndash; verglichen mit der Erde &ndash;
zwischen Nordpol und S&uuml;dpol hin und her bewegt (blauer Kreis).</P>
<BR><BR>
<H1 id="5" CLASS="western" STYLE="page-break-before: always">5.) Visuelle
Verbesserungen</H1>
<P>Die visuellen Verbesserung dienen dazu, die Wahrnehmbarkeit von
Oberfl&auml;chenmerkmalen zu erh&ouml;hen. Dazu werden bestimmte
Bereiche abgedunkelt, was bisweilen einen Effekt &auml;hnlich des
Schattenwurfes erzeugen kann, jedoch nicht von Lampen abh&auml;ngig
ist. &bdquo;Dark Edges&ldquo; und &bdquo;Bright Edges&ldquo; f&auml;rben
scharfe Kanten dunkel bzw. hell, was &Auml;hnlichkeit mit
Bleistiftstrichen hat, die die Kanten darstellen. &bdquo;Dark
Valleys&ldquo; dunkelt Vertiefungen ab. Vor allem letzterer
Algorithmus ist auch gut mit Beleuchtung kombinierbar um Schatten zu
verst&auml;rken.</P>
<IMG SRC="usermanual_enhancements.jpg" NAME="Grafik10" BORDER=0>
<P>&Uuml;ber &bdquo;Strength&ldquo; kann die St&auml;rke der Schw&auml;rzung eingestellt werden.
&bdquo;Threshold&ldquo; gibt einen Schwellwert an, ab dem Vertices eingef&auml;rbt werden.
Vertices deren Kr&uuml;mmung unter dem Schwellwert liegt, werden von dem Algorithmus nicht beachtet.
&Uuml;ber &bdquo;Smooth&ldquo; kann eingestellt werden, wie sehr das Ergebnis gegl&auml;ttet wird.
Beim Gl&auml;tten beeinflusst die Helligkeit von Knoten auch die
Helligkeit der Nachbarknoten. Der Smoothing-Wert gibt an wie viele Vertices in der Nachbarschaft des aktuellen Vertex betrachtet werden.
Bei einem Wert von 3, werden beispielsweise alle Vertices betrachtet die 3 &bdquo;Schritte&ldquo; weit entfernt sind.
Bei hohen Werten kann das Berechnen des Smoothings sehr lange dauern!</P>
<P>F&uuml;r jedes Artefakt sollten verschiedene Einstellungen
ausprobiert werden, um ein optimales Ergebnis zu erreichen.</P>
<BR><BR>
<H1 id="6" CLASS="western" STYLE="page-break-before: always">6.) Kommentare
und Vermessung</H1>
<P>Um Vermessungen vorzunehmen und Kommentare zu schreiben, m&uuml;ssen
diese zun&auml;chst mit dem H&auml;kchen &bdquo;Display points and
annotations&ldquo; eingeschaltet werden. Beim Vermessen des Objekts wird angenommen,
das alle Koordinaten in mm angegeben sind.</P>
<P>Um eine Anmerkung zu erstellen, muss im einfachsten Fall das
Artefakt an der zu kommentierenden Stelle angeklickt werden, wodurch
an der Stelle ein blauer Punkt gesetzt wird. Ein gesetzter Punkt
f&uuml;hrt dazu, dass die Schaltfl&auml;che &bdquo;Add annotation&ldquo;
aktiviert wird. Bei Bet&auml;tigung der Schaltfl&auml;che wird in
einem kleinen Fenster die M&ouml;glichkeit geboten einen Text
einzugeben. Wird dieser best&auml;tigt, kann im Anschluss  eine Farbe
f&uuml;r den Punkt ausgesucht werden. Ist diese ebenfalls best&auml;tigt,
ist der Vorgang abgeschlossen. Die Anmerkung steht nun links oben im
3D-Anzeigebereich und zeigt mit einer Linie auf den betreffenden
Punkt. Alle diese als 2D-Overlay gezeichneten Elemente k&ouml;nnen
nicht vom Artefakt verdeckt werden. Sie bleiben demzufolge auch
sichtbar, wenn sie sich auf der R&uuml;ckseite des Artefakts
befinden.</P>
<P>Soll eine Strecke gemessen werden, m&uuml;ssen daf&uuml;r
mindestens zwei Punkte angegeben werden. In dem Fall wird die direkte
Verbindung zwischen den Punkten, also der Vektor, in seiner L&auml;nge
gemessen und das Ergebnis in einem Fenster angezeigt, welches
wiederum die M&ouml;glichkeit er&ouml;ffnet, daraus eine Anmerkung zu
generieren. Ist dies nicht gew&uuml;nscht, kann der Wert einfach
abgelesen und dann abgebrochen werden. Es wird dann keine Anmerkung
generiert und auch keine Linie eingezeichnet. Soll eine komplexe
Strecke gemessen werden, k&ouml;nnen dazu beliebig viele Punkte
angeklickt werden, die Strecke wird als Summe der Teilstrecken
berechnet und angezeigt.</P>
<P>Exakt drei Punkte m&uuml;ssen gesetzt werden, um einen Winkel zu
messen. Dabei wird der Winkel f&uuml;r drei Punkte A, B und C am
Punkt A bestimmt. Auch hier wird der Wert in einem Fenster angezeigt
und die M&ouml;glichkeit der Generierung einer Anmerkung geboten.</P>
<P><IMG SRC="usermanual_annoted_artefact.jpg" NAME="Grafik6" BORDER=0></P>
<P>Drei und mehr Punkte k&ouml;nnen auch zur Berechnung einer Fl&auml;che
benutzt werden. Zuverl&auml;ssig funktioniert dies, wenn es sich um
konvexe Formen handelt, also idealerweise einen Kreis. Auch davon
abweichende Formen k&ouml;nnen gemessen werden, es muss jedoch
ber&uuml;cksichtigt werden, wie die Fl&auml;chenmessung vonstatten
geht. Aus allen Punkten, die gesetzt werden, wird am Ende ein
Mittelwert gebildet und daraus ein zus&auml;tzlicher Punkt generiert.
Er bildet den Mittelpunkt eines Dreiecksf&auml;chers, an dem alle
gesetzten Punkte teilnehmen. Hieraus ergibt sich die Notwendigkeit,
die Punkte so zu setzen, dass keine &bdquo;zu&ldquo; konkave Fl&auml;che
entsteht. Wie das obige Bild zeugt, k&ouml;nnen leicht konkave
Fl&auml;chen gemessen werden, aber nur, wenn der automatisch
berechnete Mittelpunkt so liegt, dass man von ihm eine gerade
Verbindung innerhalb der zu messenden Fl&auml;che zu jedem Randpunkt
ziehen k&ouml;nnte. Als Trick bietet es sich an, wenn unsicher ist,
ob der Mittelpunkt wie hier weit genug unten liegt, dort unten ein
paar mehr Randpunkte zu setzen, damit der Mittelpunkt als Mittel
dieser Punkte weiter runter wandert. Die Reihenfolge, in der die
Randpunkte gesetzt werden, ist nicht wichtig. Sobald die
Fl&auml;chenberechnung gestartet wird, werden die Randpunkte
automatisch sortiert und eine ausreichend konvexe Fl&auml;che
berechnet.</P>
<P>Zu allen Messwerkzeugen ist anzumerken, dass die gemessene Gr&ouml;&szlig;e
stets als Standardtext vorgegeben ist, damit diese komfortabel
&uuml;bernommen werden kann. Sie kann selbstverst&auml;ndlich
beliebig erg&auml;nzt, ge&auml;ndert oder g&auml;nzlich gel&ouml;scht
werden.</P>
<P>Um leichter mit den verschiedenen Anzahlen von Punkten zurecht zu
kommen, ist als Ged&auml;chtnisst&uuml;tze auf jeder Schaltfl&auml;che
die notwendige Punktzahl in Klammern erl&auml;utert. (3P+) hei&szlig;t
also beispielsweise, die Schaltfl&auml;che kann benutzt werden, wenn
drei oder mehr Punkte gesetzt wurden.</P>
<P>Solange die Punkte noch gesetzt werden und keine Schaltfl&auml;che
angew&auml;hlt wurde, sind sie noch ver&auml;nderbar. So k&ouml;nnen
sie mit der linken Maustaste geklickt und gezogen werden, wenn ihre
Position korrigiert werden muss. Der aktuell markierte Punkt (wei&szlig;
dargestellt) kann mit der Schaltfl&auml;che &bdquo;Delete selected&ldquo;
gel&ouml;scht werden, alle Punkte mit &bdquo;Delete all&ldquo;.</P>
<P>Ist die Anmerkung erst einmal best&auml;tigt, sind die Punkte
fixiert und k&ouml;nnen nicht mehr ge&auml;ndert werden. Allerdings
kann die Anmerkung selber noch bearbeitet werden. Dazu ist die
betreffende Anmerkung selber anzuklicken und die Schaltfl&auml;che
&bdquo;edit&ldquo; zu verwenden. Sie f&uuml;hrt wieder zum
Eingabefenster f&uuml;r Anmerkungen und zur Farbauswahl. Ebenso
verh&auml;lt es sich mit &bdquo;Delete&ldquo;, was die Anmerkung und
die zugeh&ouml;rigen Punkte l&ouml;scht.</P>
<P>Wenn viele Anmerkungen existieren, bleibt es sp&auml;testens wenn
das Objekt gedreht wird nicht aus, dass sich die Linien von den
Texten zu den Punkten &uuml;berschneiden. Daher kann, wenn das Objekt
fertig gedreht wurde, die Schaltfl&auml;che &bdquo;Rearrange&ldquo;
angeklickt werden. Dies bewirkt, dass die H&ouml;hen der relevanten
Punkte auf dem Bildschirm ermittelt werden und die Anmerkungen
dementsprechend umsortiert werden. Danach sind die Linien meist
entwirrt. Dies ist jedoch keine permanente L&ouml;sung. Wird das
Objekt gedreht, k&ouml;nnen die Linien sich erneut &uuml;berschneiden.</P>
<BR><BR>
<H1 id="7" CLASS="western">7.) Screenshots und Offscreen Rendering</H1>
<P>Um den aktuellen Inhalt des 3D-Bereichs als Bild zu speichern,
steht im Men&uuml; unter &bdquo;Tools&ldquo; den Punkt &bdquo;Screenshot&ldquo;.
Es stehen diverse g&auml;ngige Formate zur Auswahl, um den Screenshot
abzuspeichern. Screenshots sind in ihrer Aufl&ouml;sung durch den verwendeten Monitor begrenzt.
Um Abbildungen mit h&ouml;herer Qualit&auml;t zu erstellen, verwenden Sie bitte Offscreen Renderings</P>
<P> Ebenfalls im im Men&uuml; unter &bdquo;Tools&ldquo; finden Sie den Punkt &bdquo;Offscreen&ldquo;
Es &ouml;ffnet sich ein weiteres Fenster in dem sie die Qualit&auml;t des Offscreen Renderings angeben k&ouml;nnen.
Offscreen Renderings werden immer im PNG-Format gespeichert und k&ouml;nnen maximal 8192x8192 Pixel groﬂ sein.
Die Qualit&auml;t gibt an, ob und wie startk komprimiert verwendet werden soll, was allerdings verlustbehaftet sein kann.
Je niedrieger der Wert f&uuml;r die Qualit&auml;t ist, desto st&auml;rker ist die Kompression</P>
<BR><BR>
<H1 id="8" CLASS="western">8.) Datei speichern</H1>
<P>Wenn ein Artefakt in Szene gesetzt wurde, k&ouml;nnen die
Einstellungen zu Beleuchtung, Kameraposition, Farben und Anmerkungen
gespeichert werden, indem &bdquo;File&ldquo; und &bdquo;Save&ldquo;
gew&auml;hlt wird. Dabei wird die PLY-Datei nicht ge&auml;ndert, es
wird nur im gleichen Verzeichnis eine gleichnamige Datei mit der
Endung XML gespeichert, weswegen auch kein Datei-Speichern-Dialog
angezeigt wird. Eventuell schon vorhandene XML-Dateien werden dabei
nach einer Sicherheitsabfrage &uuml;berschrieben.</P>
</BODY>
</HTML>